---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.ReverseIterator
source: html/0be4ee15-8d9e-f337-b5d5-49b55853b034.htm
---
# Autodesk.Revit.DB.ReferenceArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ReferenceArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.